public/man/man1/flatpak-remote-info.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>
        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - flatpak-remote-info.1 | Technical Notes</title>

      <link rel="stylesheet" href="/css/main.min.a9ecaac9d4f7845fc2de4738f7709cab0bd1c3d19c3466fadd637a6987603257.css" integrity="sha256-qeyqydT3hF/C3kc493CcqwvRw9GcNGb63WN6aYdgMlc=" crossorigin="anonymous">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - flatpak-remote-info.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>flatpak-remote-info - Show information about an application or runtime
in a remote</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>flatpak remote-info</strong> [OPTION…] REMOTE REF</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>Shows information about the runtime or application REF from the remote
repository with the name REMOTE. You can find all configured remote
repositories with flatpak remotes.</p>
<p>
By default, the output is formatted in a friendly format. If you specify
one of the <strong>–show-…</strong> options, the output is instead formatted in a
machine-readable format.</p>
<p>
Unless overridden with the <strong>–system</strong>, <strong>–user</strong>, or <strong>–installation</strong>
options, this command uses either the default system-wide installation
or the per-user one, depending on which has the specified REMOTE.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>The following options are understood:</p>
<p>
<strong>-h</strong>, <strong>–help</strong></p>
<blockquote>
<p>Show help options and exit.</p>
</blockquote>
<p>
<strong>-u</strong>, <strong>–user</strong></p>
<blockquote>
<p>Use the per-user configuration.</p>
</blockquote>
<p>
<strong>–system</strong></p>
<blockquote>
<p>Use the default system-wide configuration.</p>
</blockquote>
<p>
<strong>–installation=NAME</strong></p>
<blockquote>
<p>Use a system-wide installation specified by NAME among those defined in
<em>etc/flatpak/installations.d</em>. Using <strong>–installation=default</strong> is
equivalent to using <strong>–system</strong>.</p>
</blockquote>
<p>
<strong>–cached</strong></p>
<blockquote>
<p>Prefer to use locally cached information if possible, even though it may
be out of date. This is faster, but risks returning stale information.
Also, some information is not cached so will not be available.</p>
</blockquote>
<p>
<strong>–runtime</strong></p>
<blockquote>
<p>Assume that REF is a runtime if not explicitly specified.</p>
</blockquote>
<p>
<strong>–app</strong></p>
<blockquote>
<p>Assume that REF is an app if not explicitly specified.</p>
</blockquote>
<p>
<strong>–arch=ARCH</strong></p>
<blockquote>
<p>The default architecture to look for, if not given explicitly in the
REF. See <strong>flatpak –supported-arches</strong> for architectures supported by the
host.</p>
</blockquote>
<p>
<strong>–commit=COMMIT</strong></p>
<blockquote>
<p>Show information about the specific commit, rather than the latest
version.</p>
</blockquote>
<p>
<strong>–log</strong></p>
<blockquote>
<p>Display a log of previous versions.</p>
</blockquote>
<p>
<strong>-r</strong>, <strong>–show-ref</strong></p>
<blockquote>
<p>Show the matched ref.</p>
</blockquote>
<p>
<strong>-c</strong>, <strong>–show-commit</strong></p>
<blockquote>
<p>Show the commit id.</p>
</blockquote>
<p>
<strong>-p</strong>, <strong>–show-parent</strong></p>
<blockquote>
<p>Show the parent commit id.</p>
</blockquote>
<p>
<strong>-m</strong>, <strong>–show-metadata</strong></p>
<blockquote>
<p>Show the metadata.</p>
</blockquote>
<p>
<strong>-v</strong>, <strong>–verbose</strong></p>
<blockquote>
<p>Print debug information during command processing.</p>
</blockquote>
<p>
<strong>–ostree-verbose</strong></p>
<blockquote>
<p>Print OSTree debug information during command processing.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
EXAMPLES
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p><strong>$ flatpak –user remote-info flathub org.gnome.gedit</strong></p>
<blockquote>
<pre class="example">
Ref: app/org.gnome.gedit/x86_64/stable
ID: org.gnome.gedit
Arch: x86_64
Branch: stable
Date: 2017-07-31 16:05:22 +0000
Subject: Build org.gnome.gedit at 3ec291fc1ce4d78220527fa79576f4cc1481ebe5
Commit: 3de7e9dde3bb8382aad9dfbbff20eccd9bf2100bc1887a3619ec0372e8066bf7
Parent: -
Download size: 3,4 MB
Installed size: 11,1 MB
Runtime: org.gnome.Platform/x86_64/3.24
</pre>
</blockquote>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
SEE ALSO
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>*flatpak*(1), *flatpak-remotes*(1) *flatpak-remote-ls*(1)</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.95916b5b8c09add4922ea47e674b5da7fc4b6347a3e8c4e25e98b4b7d236080b.js" integrity="sha256-lZFrW4wJrdSSLqR&#43;Z0tdp/xLY0ej6MTiXpi0t9I2CAs=" crossorigin="anonymous"></script>
    </body>
</html>
